Revit 2024 API
UnitFormatUtils Class
 A utility class for formatting and parsing numbers with units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static class UnitFormatUtils
Visual Basic
Public NotInheritable Class UnitFormatUtils
Visual C++
public ref class UnitFormatUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.UnitFormatUtils
See Also
UnitFormatUtils Members
Autodesk.Revit.DB Namespace